In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\009\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\009\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\009\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\009\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\009\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [33]:
import pandas as pd


ser = pd.Series([27,23,25,22,26], index = ['박주언','임단비','이창대','김민지','손상원'])
ser

박주언    27
임단비    23
이창대    25
김민지    22
손상원    26
dtype: int64

In [34]:
ser.loc['박주언':'이창대']

박주언    27
임단비    23
이창대    25
dtype: int64

In [35]:
ser.loc[['박주언','임단비','이창대']]

박주언    27
임단비    23
이창대    25
dtype: int64

In [36]:
ser.iloc[1:3]

임단비    23
이창대    25
dtype: int64

In [42]:
ser == 22

박주언    False
임단비    False
이창대    False
김민지     True
손상원    False
dtype: bool

In [44]:
ser.loc[ser == 22]

김민지    22
dtype: int64

In [46]:
import pandas as pd
df = pd.DataFrame(
[[1, 10, 100], [2, 20, 200], [3, 30, 300]],
index = ['r1', 'r2', 'r3'],
columns = ['c1', 'c2', 'c3'])
df

    c1  c2   c3
r1   1  10  100
r2   2  20  200
r3   3  30  300

In [52]:
df.loc[:,'c1']

r1    1
r2    2
r3    3
Name: c1, dtype: int64

In [51]:
df.loc['r1','c1']

1

In [55]:
df.loc[['r1','r3'],'c2':'c3']

    c2   c3
r1  10  100
r3  30  300

In [56]:
df = pd.DataFrame(
        [[1, 10, 100], [2, 20, 200], [3, 30, 300]])
df

   0   1    2
0  1  10  100
1  2  20  200
2  3  30  300

In [57]:
df.iloc[1:3,[0,2]]

   0    2
1  2  200
2  3  300

In [58]:
df = pd.DataFrame(
[[1, 10, 100], [2, 20, 200], [3, 30, 300]],
index = ['r1', 'r2', 'r3'],
columns = ['c1', 'c2', 'c3'])
df

    c1  c2   c3
r1   1  10  100
r2   2  20  200
r3   3  30  300

In [59]:
df>10 # 추출 하고 싶다

       c1     c2    c3
r1  False  False  True
r2  False   True  True
r3  False   True  True

In [62]:
df.loc[df['c2']> 10]

    c1  c2   c3
r2   2  20  200
r3   3  30  300

In [64]:
df.loc[(df['c1']>1)&(df['c3']<300)]

    c1  c2   c3
r2   2  20  200

In [1]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\009\anaconda3\lib\site-packages (3.0.9)
Requirement already satisfied: et-xmlfile in c:\users\009\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

In [2]:
import pandas as pd
import openpyxl
import os

xlsx = os.path.join('./sample/anime.xlsx')
df = pd.read_excel(xlsx)
df.head()

,anime_id,name,genre,type,episodes,rating,members
0,32281,Kimi no Na wa.,"Drama, Romance, School, Supernatural",Movie,1,9.37,200630
1,15335,Gintama Movie: Kanketsu-hen - Yorozuya yo Eien...,"Action, Comedy, Historical, Parody, Samurai, S...",Movie,1,9.10,72534
2,28851,Koe no Katachi,"Drama, School, Shounen",Movie,1,9.05,102733
3,199,Sen to Chihiro no Kamikakushi,"Adventure, Drama, Supernatural",Movie,1,8.93,466254
4,12355,Ookami Kodomo no Ame to Yuki,"Fantasy, Slice of Life",Movie,1,8.84,226193

### SQL

In [3]:
!pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
Requirement already satisfied: numpy in c:\users\009\anaconda3\lib\site-packages (from pandasql) (1.21.5)
Requirement already satisfied: pandas in c:\users\009\anaconda3\lib\site-packages (from pandasql) (1.4.2)
Requirement already satisfied: sqlalchemy in c:\users\009\anaconda3\lib\site-packages (from pandasql) (1.4.32)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\009\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\009\anaconda3\lib\site-packages (from pandas->pandasql) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\009\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\009\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (1.1.1)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py): started
  Building wheel for pandasql (setup.py): finished with status 'done'
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26784 sha256=98c540f09b390315a861ba31c318f53a04291fde04de67c4e3aca7ba31fafd97
  Stored in directory: c:\users\009\appdata\local\pip\cache\wheels\63\e8\ec\75b1df467ecf57b6ececb32cb16f4e86697cbfe55cb0c51f07
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [9]:
from pandasql import sqldf
dfsql = lambda q:sqldf(q, globals())
result = dfsql("select name,type, episodes from df where type='Movie' order by episodes desc") # * 모든것
result

                                                   name   type episodes
0                                           Animegatari  Movie  Unknown
1                          Ao Oni The Animation (Movie)  Movie  Unknown
2                                          Blame! Movie  Movie  Unknown
3                                              Godzilla  Movie  Unknown
4     Visions of Frank: Short Films by Japan&#039;s ...  Movie        9
...                                                 ...    ...      ...
2303                The Snack World: Hitogirai no Renny  Movie        1
2304  Uchiage Hanabi, Shita kara Miru ka? Yoko kara ...  Movie        1
2305  Youkai Watch Movie 3: Soratobu Kujira to Doubl...  Movie        1
2306                               Youkai Watch Movie 4  Movie        1
2307                                      Zunda Horizon  Movie        1

[2308 rows x 3 columns]

In [10]:
from pandasql import sqldf
dfsql = lambda q:sqldf(q, globals())
result = dfsql("select name,type, episodes from df where type='Movie' order by episodes desc") # * 모든것
result.to_json('./sample/sample.json', orient = 'table')

###HTML

In [14]:
url = 'https://docs.python.org/3/py-modindex.html'

table= pd.read_html(url)
table[0].loc[:,1:].dropna().head(10)

             1                                                  2
2   __future__                       Future statement definitions
3     __main__  The environment where top-level code is run. C...
4      _thread                           Low-level threading API.
7          abc    Abstract base classes according to :pep:`3119`.
8         aifc  Deprecated:  Read and write audio files in AIF...
9     argparse  Command-line option and argument parsing library.
10       array  Space efficient arrays of uniformly typed nume...
11         ast     Abstract Syntax Tree classes and manipulation.
12    asynchat  Deprecated:  Support for asynchronous command/...
13     asyncio                                  Asynchronous I/O.